{
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "genres": [
    {
      "name": "Боевик"
    },
    {
      "name": "Комедиа"
    },
    {
      "name": "Ужасы"
    },
    {
      "name": "Драма"
    },
    {
      "name": "Фантастика"
    },
    {
      "name": "Документальный"
    },
    {
      "name": "Триллер"
    },
    {
      "name": "Мультфильм"
    },
    {
      "name": "Исторический"
    },
    {
      "name": "Фэнтези"
    },
    {
      "name": "Приключения"
    },
    {
      "name": "Все"
    }
  ],
  "movies": [
    {
      "id": 1,
      "title": "Великий уравнитель",
      "year": 2018,
      "genre": "Боевик",
      "country": "США",
      "rate": "6.8",
      "desc": "Роберт МакКолл - бывший спецназовец. После увольнения со службы он собирается начать нормальную мирную жизнь, дав себе обещание больше никогда не брать в руки оружия. Но в один прекрасный момент он встречает юную девушку, зарабатывающую на жизнь проституцией, которую избивают бандиты и она попадает в больницу. Тогда он решает защитить девушку, после чего вступает в неравную схватку с русской мафией и продажными агентами ЦРУ. Ради справедливости он готов нарушить собственное обещание и применить оружие против людей, которые просто не заслуживают жить в этом мире",
      "poster": "assets/Equalizer.jpg",
      "link": "//vid1632682957922.vb17121coramclean.pw/movie/e0db856e8d748b07e3cdf04d1f3a354e/iframe"
    },
    {
      "id": 2,
      "title": "Монстры на каникулах 3: Море зовёт",
      "year": 2018,
      "genre": "Мультфильм",
      "country": "США",
      "rate": "6.3",
      "desc": "На этот раз Дракула вместе со своими друзьями отправляется в круиз на шикарном лайнере. Развлечения там на любой вкус: от монстробаскетбола и экзотических экскурсий, до лунных ванн. Неожиданно Дракула влюбляется в капитана корабля — загадочную и прекрасную Эрику, и его дочка Мэвис понимает, что поездка может превратиться в кошмар: ведь Эрика хранит ужасный секрет, который ставит под угрозу существование всех монстров!",
      "poster": "assets/monsters.jpg",
      "link": "//vid1632683061947.vb17121coramclean.pw/movie/26efc0bf37e713a37ffce23734d8c8c9/iframe"
    },
    {
      "id": 3,
      "title": "Мстители: Война бесконечности",
      "year": 2018,
      "genre": "Боевик, Приключения, Комикс",
      "country": "США",
      "rate": "8.6",
      "desc": "Пока Мстители и их союзники продолжают защищать мир от различных опасностей, с которыми не смог бы справиться один супергерой, новая угроза возникает из космоса: Танос. Межгалактический тиран преследует цель собрать все шесть Камней Бесконечности — артефакты невероятной силы, с помощью которых можно менять реальность по своему желанию. Всё, с чем Мстители сталкивались ранее, вело к этому моменту — судьба Земли никогда ещё не была столь неопределённой.",
      "poster": "assets/avengers.jpg",
      "link": "//vid1632683168823.vb17121coramclean.pw/movie/8389fa0d38f4361212533ad66fd309c1/iframe"
    },
    {
      "id": 5,
      "title": "Бегущий по лезвию 2049",
      "year": 2017,
      "genre": "Детектив, Драма, Фантастика, Триллер.",
      "country": "США",
      "rate": "8.4",
      "desc": "В недалеком будущем мир населен людьми и репликантами, созданными выполнять самую тяжелую работу. Работа офицера полиции Кей — держать репликантов под контролем в условиях нарастающего напряжения… Пока он случайно не становится обладателем секретной информации, которая ставит под угрозу существование всего человечества. Желая найти ключ к разгадке, Кей решает разыскать Рика Декарда, бывшего офицера специального подразделения полиции Лос-Анджелеса, который бесследно исчез много лет назад.",
      "poster": "assets/2049.jpg",
      "link": "//vid1632683294927.vb17121coramclean.pw/movie/62a647967267bcfa5b63d49749261263/iframe"
    },
    {
      "id": 9,
      "title": "Логан",
      "year": 2017,
      "genre": " Драма, Фантастика, Триллер, Комикс.",
      "country": "США",
      "rate": "8.3",
      "desc": "В недалеком будущем уставший от жизни Логан заботится о больном профессоре Икс, который прячется неподалеку от мексиканской границы. Но Логан больше не сможет скрывать свое прошлое, когда встретится с юным мутантом, которого преследуют темные силы.",
      "poster": "assets/logan.jpg",
      "link": "//vid1632687790687.vb17121coramclean.pw/movie/1ca4c64c6820a544ea2cc96c1a715d9f/iframe"
    },
    {
      "id": 10,
      "title": "Прибытие",
      "year": 2017,
      "genre": " Драма, Фантастика, Триллер, Комикс.",
      "country": "США",
      "rate": "8.0",
      "desc": "Неожиданное появление неопознанных летающих объектов в разных точках планеты повергает мир в трепет. Намерения пришельцев не ясны - вооруженные силы всего мира приведены в полную боевую готовность, а лучшие умы человечества пытаются понять, как разговаривать с непрошеными гостями. Правительство обращается за помощью к лингвисту Луизе Бэнкс и физику Яну Доннели, чтобы предотвратить глобальную катастрофу и найти общий язык с пришельцами. Отныне судьба человечества находится в их руках.",
      "poster": "assets/comming.jpg",
      "link": "//vid1632687855624.vb17121coramclean.pw/movie/d1dca323fc1efec39881d866f001f532/iframe"
    },
    {
      "id": 11,
      "title": "Реинкарнация",
      "year": 2018,
      "genre": " Детектив, Драма, Ужасы, Триллер.",
      "country": "США",
      "rate": "7.3",
      "desc": "После смерти матери Энни Грэхем в её ранее спокойном доме начинает твориться нечто необъяснимое. Теперь под угрозой жизнь её близких. С каждым днём открываются новые ужасающие секреты их семьи.Энни осознаёт, что эти кошмары берут своё начало в далёком прошлом. Сможет ли она найти ключ к тайне зловещего проклятия, которое передаётся из поколения в поколение…",
      "poster": "assets/reincarnation.jpg",
      "link": "//vid1632687918109.vb17121coramclean.pw/movie/7fcf921a32dc6c6d1c9394ab915d2437/iframe"
    },
    {
      "id": 12,
      "title": "Марсианин",
      "year": 2015,
      "genre": " Детектив, Драма, Ужасы, Триллер.",
      "country": "США, Великобритания.",
      "rate": "8.2",
      "desc": "Марсианская миссия «Арес-3» в процессе работы была вынуждена экстренно покинуть планету из-за надвигающейся песчаной бури. Инженер и биолог Марк Уотни получил повреждение скафандра во время песчаной бури. Сотрудники миссии, посчитав его uпогибшим, эвакуировались с планеты, оставив Марка одного.Очнувшись, Уотни обнаруживает, что связь с Землёй отсутствует, но при этом полностью функционирует жилой модуль. Главный герой начинает искать способ продержаться на имеющихся запасах еды, витаминов, воды и воздуха ещё 4 года до прилёта следующей миссии «Арес-4».По мотивам одноименного романа Энди Уира.",
      "poster": "assets/martian.jpg",
      "link": "//vid1632687982387.vb17121coramclean.pw/movie/e61d5c6505f1ece331e8a7c93cf86045/iframe"
    },
    {
      "id": 13,
      "title": "Оно",
      "year": 2017,
      "genre": "Ужасы, Триллер.",
      "country": "США, Канада.",
      "rate": "7.6",
      "desc": "Когда в городке Дерри, штат Мэн, начинают пропадать дети, несколько ребят сталкиваются со своими величайшими страхами и вынуждены помериться силами со злобным клоуном Пеннивайзом, чьи проявления жестокости и список жертв уходят в глубь веков.",
      "poster": "assets/it.jpg",
      "link": "//player.zogonka.org/embed/kp-453397"
    },
    {
      "id": 14,
      "title": "Кредо убийцы",
      "year": 2016,
      "genre": "Боевик, Фантастика, Фэнтези, Приключения.",
      "country": "Великобритания, Франция, Гонконг, США, Тайвань, Мальта, Канада.",
      "rate": "6.1",
      "desc": "Благодаря революционным технологиям, позволяющим вызвать в памяти воспоминания прежних поколений, Каллум Линч проживает приключения своего предка Агилара в Испании 15-го века. Каллум узнает, что является потомком членов загадочного тайного общества ассасинов. Накопив невероятные знания и навыки, он вступает в противостояние с могущественной и жестокой организацией тамплиеров в наши дни.",
      "poster": "assets/assasinscreed.jpg",
      "link": "//vid1632859113623.vb17121coramclean.pw/movie/0cdd6564a337c34a2ce371594890ce09/iframe"
    },
    {
      "id": 15,
      "title": "Иностранец",
      "year": 2017,
      "genre": "Боевик, Детектив, Драма, Криминал, Триллер",
      "country": " Великобритания, Китай, США",
      "rate": "7.1",
      "desc": "Бывший спецагент, ветеран вьетнамской войны Цюань давно сложил оружие и завел мирную жизнь. Но после того, как в теракте прямо на глазах погибает его дочь-подросток, видя, что власти не спешат разыскивать преступников, Цюань сам начинает поиск убийцы. Он пойдет на все, чтобы совершить праведное возмездие…",
      "poster": "assets/foreighner.jpg",
      "link": "//vid1632859181697.vb17121coramclean.pw/movie/ddd804dca40b1a2e56dd3b9959a0b775/iframe"
    },
    {
      "id": 16,
      "title": "Выживший",
      "year": 2015,
      "genre": "Драма, Приключения, Триллер, Вестерн.",
      "country": "США",
      "rate": "8.1",
      "desc": "Охотник Хью Гласс серьезно ранен на неизведанных просторах американского Дикого Запада. Товарищ Хью по отряду покорителей новых земель Джон Фицжеральд предательски оставляет его умирать в одиночестве. Теперь у Гласса осталось только одно оружие - его сила воли. Он готов бросить вызов первобытной природе, суровой зиме и враждебным племенам индейцев, только чтобы выжить и отомстить Фицжеральду.",
      "poster": "assets/immortal.jpg",
      "link": "//vid1632859266334.vb17121coramclean.pw/movie/ec42abcd81acb7aea76f3f2e96e25e2d/iframe"
    },
    {
      "id": 16,
      "title": "Дюнкерк",
      "year": 2017,
      "genre": "Драма.",
      "country": " Великобритания, Нидерланды, Франция, США.",
      "rate": "7.9",
      "desc": "Фильм расскажет историю чудесного спасения более трехсот тысяч солдат в ходе Дюнкеркской операции, имевшей место в начале Второй мировой войны. События начинаются с окружения сотен тысяч британских и союзных войск силами противника. Пойманные в ловушку на пляже, и находясь спиной к морю, они сталкиваются лицом к лицу с неразрешимой ситуацией, тем временем как тиски противника сжимаются все сильнее и сильнее.",
      "poster": "assets/dunkerk.jpg",
      "link": "//vid1632859380475.vb17121coramclean.pw/movie/da33f4651e5018bd6c06bbf58be9805c/iframe"
    },
    {
      "id": 17,
      "title": "Джон Уик",
      "year": 2014,
      "genre": " Боевик, Триллер.",
      "country": " США, Канада, Китай.",
      "rate": "7.2",
      "desc": "Джон Уик - бывший наемный убийца - ведет размеренную жизнь, когда преступник крадет его любимый Mustang 1969 года и попутно убивает собаку Дейзи, единственное живое напоминание об умершей жене. Жажда мести пробуждает в нем, казалось, утерянную хватку...",
      "poster": "assets/johnwick.jpg",
      "link": "//vid1632859443122.vb17121coramclean.pw/movie/9390f2a7b78311627f2e2bd1e05f4859/iframe"
    },
    {
      "id": 18,
      "title": "Kingsman: Золотое кольцо",
      "year": 2017,
      "genre": "Комедия, Боевик, Приключения, Комикс.",
      "country": "Великобритания, США.",
      "rate": "7.0",
      "desc": "Эггси стал опытным оперативником Kingsman, и теперь пытается лавировать между своей обыденной жизнью и работой агента. Но внезапный удар неизвестного противника забирает жизни его друзей и соратников, а службу Kingsman лишает штаб-квартиры. Оставшиеся в живых оперативники вынуждены искать помощи у внезапно обнаружившихся за океаном коллег из американской организации Statesman, чтобы вычислить своих врагов. Однако, долго ждать не приходится, и коварный противник сам выходит на сцену, ставя своим планом под угрозу жизни миллионов людей по всему миру.",
      "poster": "assets/kingsmagold.jpg",
      "link": "//vid1632859524094.vb17121coramclean.pw/movie/44aa31a1200ecb88fd2ed6baf1b0a635/iframe"
    },
    {
      "id": 19,
      "title": "Angry Birds в кино",
      "year": 2016,
      "genre": "Комедия, Мультфильм, Приключения.",
      "country": "США, Финляндия.",
      "rate": "6.3",
      "desc": "Фильм расскажет о том, как началось знаменитое противостояние птичек и свинок, персонажей популярной компьютерной игры, а также раскроет некоторые секреты любимых героев.",
      "poster": "assets/angry.jpg",
      "link": "//vid1632859622227.vb17121coramclean.pw/movie/20c0a6f19d69c97bd8817c3f2c6f2b59/iframe"
    },
    {
      "id": 20,
      "title": "Волк с Уолл-стрит",
      "year": 2013,
      "genre": "Комедия, Драма, Криминал.",
      "country": "США",
      "rate": "8.2",
      "desc": "Джордан Белфорт основал одну из крупнейших брокерских контор в 1987 году, но десять лет спустя был осужден за отмывание денег и ряд прочих финансовых преступлений. Он справился с алкогольной и наркотической зависимостью, выработанной за время махинаций на Уолл-стрит, написал две книги и теперь читает лекции о том, как достичь успеха.",
      "poster": "assets/wolf.jpg",
      "link": "http://baskino.me/films/biograficheskie/9451-volk-s-uoll-strit.html"
    },
    {
      "id": 21,
      "title": "Хоббит: Пустошь Смауга",
      "year": 2013,
      "genre": "Фэнтези, Приключения.",
      "country": "США, Новая Зеландия.",
      "rate": "8.0",
      "desc": "Продолжение путешествия хоббита Бильбо Бэггинса, волшебника Гэндальфа и 13 отважных гномов. Их компания обязана завершить своё путешествие к Одинокой горе. Там они должны встретиться с величайшей опасностью из всех — созданием куда более ужасающим, чем все их прошлые противники, которое проверит на прочность не только их мужество, но крепость их дружбы и правильность выбранного пути, — драконом Смаугом.",
      "poster": "assets/Hobbit_-_Desolation_of_Smaug.jpg",
      "link": "//vid1632859915032.vb17121coramclean.pw/movie/c1f9f5ab13c372f878f6b86fe19c8967/iframe"
    },
    {
      "id": 22,
      "title": "Гарри Поттер и Принц-полукровка",
      "year": 2009,
      "genre": "Мелодрама, Фэнтези, Приключения.",
      "country": "США, Великобритания.",
      "rate": "7.5",
      "desc": "Теперь не только мир волшебников, но и мир маглов ощущает на себе все возрастающую силу Волан-де-Морта, а Хогвартс уже никак не назовешь надежным убежищем, каким он был раньше. Гарри подозревает, что в самом замке затаилась некая опасность, но Дамблдор больше сосредоточен на том, чтобы подготовить его к финальной схватке, которая, как он знает, уже не за горами. Вместе они пытаются разгадать секрет бессмертия Волан-де-Морта, а для этого Дамблдор приглашает на должность преподавателя по зельеварению своего старинного друга и коллегу — профессора Горация Слизнорта, который обожает устраивать вечеринки для избранных и гордится своими обширными связями в высших кругах. Но этот бонвиван и не подозревает, что как раз от него Дамблдор надеется заполучить самую важную информацию о крестражах.Тем временем учеников атакуют самые разные враги, а подростковые эмоции хлещут через край. Гарри начинает понимать, что становится все более неравнодушным к Джинни, однако, и Дин Томас тоже. А Лаванда Браун вбила себе в голову, что Рон — тот самый единственный, которого она ждет, да вот только не учла волшебного эффекта шоколадных конфет Ромильды Вейн! Ну и, наконец, Гермиона пылает жгучей ревностью, но старается не показывать своих чувств. Пока романтические отношения расцветают, лишь один ученик остается в стороне. Он твердо намерен оставить свою метку, темную метку. Любовь витает в воздухе, но впереди ждет беда, и Хогвартс, возможно, уже никогда не будет прежним.По одноименному роману Джоан Роулинг.",
      "poster": "assets/Harry_Potter_and_the_Half-Blood_Prince.jpg",
      "link": "//vid1632859998867.vb17121coramclean.pw/movie/66b509f5498ee7140049beed3c439a46/iframe"
    },
    {
      "title": "Большая игра",
      "year": 2018,
      "rate": "7.5",
      "desc": "Молли Блум называли Принцессой покера. Она построила самое дорогое подпольное казино в Голливуде. Каждую минуту здесь шли ва-банк кинозвезды, шейхи, миллиардеры. Большие деньги пахнут кровью. Как выжить, когда за тобой охотится мафия и ФБР?",
      "genre": "мафия, биография, азартные игры.",
      "poster": "assets/molly.jpg",
      "link": "//vid1632515509310.vb17121coramclean.pw/movie/840b7f66c3d27afcc913307b8834b473/iframe",
      "id": 29
    },
    {
      "title": "Пила: Спираль",
      "year": 2021,
      "genre": "Детектив, Ужасы, Триллер.",
      "desc": "Импульсивный детектив полиции Нью-Йорка Зик Бэнкс всю жизнь пытается вырваться из тени своего отца, прославленного ветерана правоохранительных органов. Однажды Бэнксу и его новому напарнику поручают расследование серии жестоких убийств, которые странным образом напоминают преступления прошлых лет. Так они оказываются в эпицентре зловещей игры, и цена проигрыша в ней — человеческая жизнь.",
      "rate": "5.8",
      "poster": "assets/spiral.jpg",
      "link": "//vid1632936900341.vb17121coramclean.pw/movie/0236d72ab893f9349bb228b8557d91aa/iframe",
      "id": 30
    },
    {
      "title": "Пила",
      "year": 2004,
      "genre": "Детектив, Ужасы, Триллер.",
      "desc": "Двое незнакомцев просыпаются в странном подвальном помещении. В центре помещения – труп мужчины с простреленной головой и оружием в ослабевшей руке. Они же прикованы к стенам цепями за щиколотки. Оба не знают, как там оказались. Путём нехитрых предположений и спрятанных вокруг них ответов, как частей какого-то паззла, они узнают, по крайней мере, зачем они здесь и что именно от них ждёт их Похититель. Голос с найденной плёнки бесстрастно вещает: «Если ты хочешь спасти свою жену и детей, убей другого». Убить другого можно, только дотянувшись до оружия. Дотянуться до оружия нельзя иначе, как избавившись от цепи. Избавиться от цепи нельзя иначе, кроме как отпилив ногу. Времени – мало. Но достаточно, чтобы реконструировать цепочку странных событий, которые привели каждого из них туда, где они сейчас оказались…",
      "rate": "7.7",
      "poster": "assets/saw.jpg",
      "link": "//vid1632937937693.vb17121coramclean.pw/movie/2bfe7ad248ad92d16c28dc5dd33001f5/iframe",
      "id": 31
    },
    {
      "title": "",
      "year": null,
      "genre": "",
      "desc": null,
      "rate": null,
      "poster": "C:\\fakepath\\angry.jpg",
      "link": "",
      "id": 32
    },
    {
      "title": "",
      "year": null,
      "genre": "",
      "desc": null,
      "rate": null,
      "poster": "C:\\fakepath\\foreighner.jpg",
      "link": "",
      "id": 33
    },
    {
      "title": "",
      "year": null,
      "genre": "",
      "desc": null,
      "rate": null,
      "poster": "",
      "link": "",
      "id": 34
    },
    {
      "title": "",
      "year": null,
      "genre": "",
      "desc": null,
      "rate": null,
      "poster": "",
      "link": "",
      "id": 35
    },
    {
      "title": "",
      "year": null,
      "genre": "",
      "desc": null,
      "rate": null,
      "poster": "",
      "link": "",
      "id": 36
    }
  ]
}